{
	"jobTitle": "Engenheiro de Software em Boston Consulting Group",
	"introduction.text": "Eu crio aplicações web e pipelines de dados para aumentar a eficiência corporativa e entregar valor estratégico.",
	"bio.title": "Bio",
	"bio": [
		[
			{
				"type": "text",
				"text": "Meu fascínio por computadores vem desde a infância. Na adolescência, eu brinquei um pouco com Pascal e Ruby, criando jogos de console baseados em texto, inspirados por "
			},
			{
				"type": "link",
				"text": "Dwarf Fortress",
				"url": "https://pt.wikipedia.org/wiki/Dwarf_Fortress"
			},
			{
				"type": "text",
				"text": "."
			}
		],
		[
			{
				"type": "text",
				"text": "Na faculdade me tornei mais sério a respeito da programação, aprendendo Python, desenvolvendo ferramentas de cálculo numérico, "
			},
			{
				"type": "link",
				"text": "animações simples",
				"url": "https://www.youtube.com/watch?v=fplE6zBv0q4"
			},
			{
				"type": "text",
				"text": ", participando de "
			},
			{
				"type": "link",
				"text": "grupos de estudo em Inteligência Artificial",
				"url": "https://sitegrupoturing.netlify.app/"
			},
			{
				"type": "text",
				"text": " e "
			},
			{
				"type": "link",
				"text": "indo em eventos sobre criptografia e segurança nas redes",
				"url": "https://2023.cryptorave.org/"
			},
			{
				"type": "text",
				"text": "."
			}
		],
		[
			{
				"type": "text",
				"text": "Na minha vida profissional, eu tive o privilégio de trabalhar em "
			},
			{
				"type": "link",
				"text": "um órgão do governo alemão",
				"url": "https://www.dwih-saopaulo.org"
			},
			{
				"type": "text",
				"text": ", em "
			},
			{
				"type": "link",
				"text": "uma software house",
				"url": "https://www.brickabode.com/"
			},
			{
				"type": "text",
				"text": " e em uma consultoria "
			},
			{
				"type": "link",
				"text": "Big Four",
				"url": "https://www.bcg.com/"
			},
			{
				"type": "text",
				"text": ". Eu trabalho próximo às necessidades dos clientes para desenvolver aplicações web e pipelines de dados com uma ampla gama de tecnologias."
			}
		],
		[
			{
				"type": "text",
				"text": "Em 2024, eu conquistei uma certificação AWS como "
			},
			{
				"type": "link",
				"text": "Solutions Architect (Associate)",
				"url": "https://www.credly.com/badges/33bf2e2f-383f-4ade-878d-2f5d716bb7b5"
			},
			{
				"type": "text",
				"text": ", atestando meu conhecimento aprofundado no uso da computação em nuvem para construir aplicações web estáticas e dinâmicas, bancos de dados, implementar cachês, segurança, e muito mais."
			}
		],
		[
			{
				"type": "text",
				"text": "No meu tempo livre, gosto de estudar idiomas (atualmente aprendendo chinês), de nadar, correr, e cantar karaokê."
			}
		]
	],
	"fullCV": "Veja aqui meu currículo completo",
	"experience.title": "Experiência",
	"experiences": [
		{
			"start": "2022",
			"end": "Present",
			"company": "BCG — The Boston Consulting Group",
			"link": "https://www.bcg.com/",
			"title": "Engenheiro de Software",
			"description": "Trabalho fortemente associado às equipes de Data Science para criar ferramentas como dashboards, otimizações e simulações para clientes Fortune 500. Os projetos entregaram significativas melhores nas práticas de precificação e na satisfação dos consumidores."
		},
		{
			"start": "2021",
			"end": "2022",
			"company": "Brick Abode",
			"link": "https://www.brickabode.com/",
			"title": "Engenheiro de Software",
			"description": "Manutenção e desenvolvimento de sistemas ETL com dados de mídias sociais para um think thank nos EUA. Desenvolvimento de um editor WYSIWYG customizado para uma empresa do setor imobiliário em Hong Kong."
		},
		{
			"start": "2019",
			"end": "2021",
			"company": "Centro Alemão de Ciência e Inovação",
			"link": "https://www.dwih-saopaulo.org/",
			"title": "Estagiário em Relações Públicas / Assistente de Projetos",
			"description": "Assistência na organização de diversos eventos com até 1000 participantes da academia e indústria do Brasil e da Alemanha. Revisão do website, mídias sociais e materiais impressos."
		}
	],
	"projects.title": "Projetos",
	"projects.caveat": "Obs.",
	"projects.intro": "Por motivos de confidencialidade, não posso exibir o trabalho entregue para a maioria dos clientes. Os projetos abaixo foram desenvolvidos no meu tempo livre ao longo de vários anos, então sua consistência pode variar.",
	"projects.homepage": "Esse é o código para essa página que você está visualizando agora. Inclui scripts Terraform e uma função Lambda@Edge.",
	"projects.flashcard-factory": "Eu estava estudando chinês e vi que dava muito trabalho digitar transcrições e gravar áudio para cada flashcard que eu criava. Então decidi automatizar o processo usando uma biblioteca Go e o sintetizador de voz da Amazon.",
	"projects.michelangelo": "Uma loja de departamento para todas as suas necessidades renascentistas (uma solução full-stack minificada para um e-commerce).",
	"projects.neologism-generator": "Cria palavras divertidas e poéticas por meio da aplicação de um processo Markov sobre listas de palavras para vários idiomas.",
	"projects.snow-animation": "Uma animação web de neve caindo em dias de vento.",
	"cv": "Currículo"
}